-- INSERT INTO officebranch (office_number, address, phone_number, latitude_coordinate, longitude_coordinate)
-- SELECT i, 'Address ' || i, '+7(123)456-78-9' || i, 0, 0
-- FROM generate_series(1, 10) as i;

INSERT INTO officebranch (address, phone_number, latitude_coordinate, longitude_coordinate)
VALUES ('г. Москва, ул. Арбат, 33/12, стр. 1', '+7(123)456-78-91', 37.53124344917664, 55.7413421833643),
       ('г. Москва, ул. Пятницкая, 2/38, стр. 1', '+7(123)456-78-92', 37.56699433158104, 55.76439227509185),
       ('г. Москва, ул. Марксистская, 9', '+7(123)456-78-93', 37.57674737483574, 55.77185671917222),
       ('г. Москва, б-р Энтузиастов, 2', '+7(123)456-78-94', 37.54176699630465, 55.789470320015724),
       ('г. Москва, ул. Красноказарменная, 23', '+7(123)456-78-95', 37.59196012078201, 55.69305349859678),
       ('г. Москва, ул. Перовская, 8, к. 1', '+7(123)456-78-96', 37.81707492187064, 55.749122390592795),
       ('г. Москва, п. Внуковское, ул. Летчика Ульянина, 5', '+7(123)456-78-97', 37.47596264801117, 55.72975040956509),
       ('г. Москва, п. Воскресенское, 27', '+7(123)456-78-98', 37.51340732051678, 55.81650356353164),
       ('г. Москва, п. Рязановское, пос. Знамя Октября, мкр. Родники, 8', '+7(123)456-78-99', 37.58368332650128,
        55.74975121950596),
       ('г. Москва, ул. Волжский бульвар квартал 113А, к. 1', '+7(123)456-78-100', 37.63105418801617,
        55.74196383497035);

INSERT INTO safe_type (size, width, height, deep, description, price_of_day)
VALUES ('XS', 10, 10, 10, 'Small safe', 15.0),
       ('S', 20, 20, 20, 'Medium safe', 20.0),
       ('L', 30, 30, 30, 'Large safe', 30.0),
       ('XL', 40, 40, 40, 'Extra large safe', 40.0);

WITH RECURSIVE t(office_id, i) AS (SELECT id, generate_series(1, 10) as i
                                   FROM officebranch)
INSERT
INTO safes (safe_type_id, office_id, status)
SELECT (i % 4) + 1,
       office_id,
       CASE (i % 3) + 1
           WHEN 1 THEN 'FREE'
           WHEN 2 THEN 'RESERVED'
           WHEN 3 THEN 'RENTED'
           END
FROM t;
UPDATE safes SET status = 'FREE' WHERE status <> 'FREE';


select longitude_coordinate from officebranch;

[55.7413421833643,37.53124344917664] - г. Москва, ул. Арбат, 33/12, стр. 1
[55.76439227509185,37.56699433158104], - г. Москва, ул. Пятницкая, 2/38, стр. 1
[55.77185671917222,37.57674737483574], - г. Москва, ул. Марксистская, 9
[55.789470320015724,37.54176699630465] - г. Москва, б-р Энтузиастов, 2
[55.69305349859678,37.59196012078201], - г. Москва, ул. Красноказарменная, 23
[55.749122390592795,37.81707492187064] - г. Москва, ул. Перовская, 8, к. 1
[55.72975040956509,37.47596264801117] - г. Москва, п. Внуковское, ул. Летчика Ульянина, 5
[55.81650356353164,37.51340732051678] - г. Москва, п. Воскресенское, 27
[55.74975121950596,37.58368332650128] - г. Москва, п. Рязановское, пос. Знамя Октября, мкр. Родники, 8
[55.74196383497035,37.63105418801617] - г. Москва, ул. Волжский бульвар квартал 113А, к. 1


